var luckyRuleHTML = '<p>1)  周一到周五每天2轮抢红包活动，分别为上午9:30和下午14:30；</p>'+
'<p>2)  红包最大面额为999元，每轮活动红包数量有限，先抢先得，抢完即止；</p>'+
'<p>3)  用户通过丹露网（www.danlu.com）或丹露终端店APP（<a href="//app.danlu.com" target="_blank">下载APP</a>）均可参与；</p>'+
'<p>4)  用户需登录账号后才可参与活动，同一轮活动只能通过丹露网或丹露终端店APP其中一种方式参与，不可重复参加；</p>'+
'<p>5)  红包在丹露网或终端店APP下单时均可使用，不受品类限制（白酒/葡萄酒/茶/其它饮品等均可使用）；</p>'+
'<p>6)  红包自抢到之日起30天内有效，超出时间后自动失效；</p>'+
'<p>7)  红包不找零、不兑现、不能转赠；</p>'+
'<p>8)  本活动规则及最终解释权归丹露网所有。如有疑问，请联系丹露客服4000-11-6666；</p>',

regRuleHTML = '<p>1)  活动从即日起至2017年12月31日止；</p>'+
'<p>2)  凡通过丹露网或丹露终端店APP注册的用户均可获得红包；</p>'+
'<p>3)  终端店注册需要审批，一般在3个工作日内完成；</p>'+
'<p>4)  该红包在丹露网或丹露终端店APP下单时使用，不受品类限制（白酒/葡萄酒/茶/其它饮品等均可使用）；</p>'+
'<p>5)  红包自注册成功之日起30天内有效，超出时间后自动失效；</p>'+
'<p>6)  红包不找零、不兑现、不能转赠；</p>'+
'<p>7)  本活动规则及最终解释权归丹露网所有。如有疑问，请联系丹露客服4000-11-6666；</p>',

lotteryRuleHTML = '<p>1)  活动时间为每周一到周日，次周一开始进行上周活动的抽奖，抽奖机会不能累计，必须一周内使用；</p>'+
'<p>2)  在活动时间内通过丹露网或丹露终端店APP将订单状态变更为“已完成”的订单，才能获得抽奖机会；</p>'+
'<p>3)  每周交易量累计800-5000元（含800元），即可获得1次抽奖机会；累计5000-10000元（含5000）获得2次机会；累计10000-50000元（含10000）获得3次机会；累计50000元以上，获得4次抽奖机会。最多可获4次抽奖机会；</p>'+
'<p>4)  抽奖开始前（每周一）丹露网会以短信发送至注册手机号码和APP消息等方式告知抽奖时间，如果抽奖活动期间用户未登录活动页面参与抽奖，则失去抽奖机会；</p>'+
'<p>5)  抽奖为概率性事件，不能保证每位用户都中奖；</p>'+
'<p>6)  如果中奖，正常情况下，红包将于5-10分钟后自动发放到您的个人账户；</p>'+
'<p>7)  该红包在丹露网或终端店APP下单时均可使用，不受品类限制（白酒/葡萄酒/茶/其它饮品等均可使用）；</p>'+
'<p>8)  红包自成功领取之日起30天内有效，超出时间后自动失效；</p>'+
'<p>9) 红包不找零、不兑现、不能转赠；</p>'+
'<p>10) 本活动规则及最终解释权归丹露网所有。如有疑问，请联系丹露客服4000-11-6666；</p>',

monthRuleHTML = '<p>1)  凡在丹露网进行交易的终端店，将以月为单位计算排名，名列前茅者，将有机会获得丹露网的活动奖品；</p>'+
'<p>2)  排名的计算参数包含当月交易量、交易天数、交易单数等；</p>'+
'<p>3)  每月奖品总值合计20万元人民币，设有一等奖1名，二等奖3名，三等奖10名，四等奖20名、五等奖若干；</p>'+
'<p>4)  获奖终端店，必须满足“自行在丹露网注册、下单交易”和“交易均真实有效”两个条件；</p>'+
'<p>5)  每月获奖名单统计完毕后，将于次月在丹露网进行公示，若有异议请以书面形式向公司提交，自公示起三日后无异议，将进行发奖；</p>'+
'<p>6)  活动奖品由丹露网进行发放，届时，将以APP消息、短信、电话等方式通知获奖用户；</p>'+
'<p>7)  获奖终端店，有义务配合丹露网进行拍照、采访等相关宣传事宜；</p>'+
'<p>8)  本活动规则及最终解释权归丹露网所有。如有疑问，请致电丹露客服4000-11-6666；</p>'

 winningList='<div class="list-table">' +
'<div class="wrap">'+
'<div class="row head ">'+
'<div class="col">终端店名</div>'+
'<div class="col">手机号</div>'+
'<div class="col">所中奖项</div></div>'+
'<div class="list-wrap">'+
'<div class="list">' +
     //'<div class="row "><div class="col">te*****店</div><div class="col">182****1</div><div class="col">20元红包</div></div>' +
     '</div>'+
'</div> </div> </div>',
 //   luckData=[{"name":"CC信息111","tel":"15182982621","couponAmt":18800},{"name":"xx","tel":"13596584785","couponAmt":11800},{"name":"xx","tel":"13596584785","couponAmt":1800},{"name":"CC信息111","tel":"15182982621","couponAmt":900},{"name":"CC信息111","tel":"15182982621","couponAmt":800},{"name":"xx","tel":"13596584785","couponAmt":500}],
    lotteryData=undefined,
    luckData=undefined;
    monthWinList="<dl>" +
        "<dt>一等奖：</dt>" +
            "<dd>张三</dd>"+
        "<dt>二等奖：</dt>" +
           "<dd></dd>"+
        "<dt>二等奖：</dt>" +
          "<dd></dd>"+
        "</dl>"
